PKS1C/src/DataProcessors/ГрафикДежурств/ГрафикДежурств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ГрафикДежурств</name>
</mdclass:DataProcessor>

PKS1C/src/InformationRegisters/ГрафикДежурств/ГрафикДежурств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикДежурств</name>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/DataProcessors/ГрафикДежурств/Forms/Форма/Module.bsl
&НаКлиенте
Процедура КалендарьПриВыводеПериода(Элемент, ОформлениеПериода)
	Для Каждого СтрокаОформленияПериода Из ОформлениеПериода.Даты Цикл
		//ЦветОформленияДня = ЦветаВидовДней.Получить(ВидыДней.Получить(СтрокаОформленияПериода.Дата));
		//Если ЦветОформленияДня = Неопределено Тогда
		//	ЦветОформленияДня = ОбщегоНазначенияКлиент.ЦветСтиля("ВидДняПроизводственногоКалендаряНеУказанЦвет");
		//КонецЕсли;
		//СтрокаОформленияПериода.ЦветТекста = ЦветОформленияДня;
		//СтрокаОформленияПериода.ЦветФона = WebЦвета.Аквамарин;
		Если ЗначениеЗаполнено(ПолучитьДежурного(СтрокаОформленияПериода.Дата)) Тогда
			СтрокаОформленияПериода.ЦветФона = WebЦвета.Красный;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПриАктивизацииДаты(Элемент)
	Сотрудник = ПолучитьДежурного(Календарь);
	Сверхурочка = ПолучитьДанныеСверхурочки(Календарь);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДежурного(Дата)
	МенеджерЗаписи = РегистрыСведений.ГрафикДежурств.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = Дата;
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Сотрудник;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеСверхурочки(Дата)
	МенеджерЗаписи = РегистрыСведений.ГрафикДежурств.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Дата = Дата;
	МенеджерЗаписи.Прочитать();
	Возврат МенеджерЗаписи.Сверхурочка;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Календарь = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Форма = ПолучитьФорму("Обработка.ГрафикДежурств.Форма.ФормаИзмененияДежурного",Новый Структура("Дата,Дежурный,Сверхурочка",Календарь,Сотрудник,Сверхурочка));
	НовыеПараметрыДежурного = Форма.ОткрытьМодально();
	Если Не НовыеПараметрыДежурного = Неопределено Тогда
		Сотрудник = НовыеПараметрыДежурного.Сотрудник;
		Календарь = НовыеПараметрыДежурного.Дата;
		Сверхурочка = НовыеПараметрыДежурного.Сверхурочка;
		Элементы.Календарь.Обновить();
	КонецЕсли;;
КонецПроцедуры

&НаКлиенте
Процедура КалендарьВыбор(Элемент, ВыбраннаяДата)
	Форма = ПолучитьФорму("Обработка.ГрафикДежурств.Форма.ФормаИзмененияДежурного",Новый Структура("Дата,Дежурный,Сверхурочка",Календарь,Сотрудник,Сверхурочка));
	НовыеПараметрыДежурного = Форма.ОткрытьМодально();
	Если Не НовыеПараметрыДежурного = Неопределено Тогда
		Сотрудник = НовыеПараметрыДежурного.Сотрудник;
		Календарь = НовыеПараметрыДежурного.Дата;
		Сверхурочка = НовыеПараметрыДежурного.Сверхурочка;
		Элементы.Календарь.Обновить();
	КонецЕсли;
КонецПроцедуры
